Revit 2027 API
SizingCalculator.CalculateSizeByFriction Method
 Calculates the duct or pipe size based on the specified flow and friction.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void CalculateSizeByFriction(
	double flow,
	double friction,
	SizingOptions sizingOptions
)
Public Sub CalculateSizeByFriction (
	flow As Double,
	friction As Double,
	sizingOptions As SizingOptions
)
public:
void CalculateSizeByFriction(
	double flow,
	double friction,
	SizingOptions^ sizingOptions
)
member CalculateSizeByFriction :
        flow : float *
        friction : float *
        sizingOptions : SizingOptions -> unit
Parameters
flow Double
 The flow rate.
friction Double
 The desired friction.
sizingOptions SizingOptions
 The sizing options containing other input sizing parameters (such as density, viscosity, roughness, etc.) and output sizes.
Exceptions
Exception | Condition
ArgumentException |  The input must be initialized correctly for sizing operation.
ArgumentNullException |  A non-optional argument was null
ArgumentOutOfRangeException |  The given value for flow must be positive. -or- The given value for friction must be positive.
InvalidOperationException |  Failed to calculate the size to satisfy the friction constraint.
See Also
Reference
SizingCalculator Class
Autodesk.Revit.DB.Analysis Namespace